new Vue({
    el: "#app",
    data: {
        //Создаем переменные с которыми мы будем работать
        cities: ["Москва", "Санкт-Петербург", "Омск", "Новосибирск"],
        factories: {
            "Москва": ["Цех #2", "Цех #21", "Цех #65", "Цех #3"],
            "Санкт-Петербург": ["Цех #32", "Цех #2", "Цех #1"],
            "Омск": ["Цех #212", "Цех #64", "Цех #32"],
            "Новосибирск": ["Цех #23", "Цех #78", "Цех #26"]
        },
        workers: {
            "Москва": ["Андрей", "Алексей", "Владимир", "Генадий"],
            "Санкт-Петербург": ["Григорий", "Андрей", "Максим"],
            "Омск": ["Сергей", "Владимир", "Максим"],
            "Новосибирск": ["Андрей", "Денис", "Иван"]
        },
        selectedCity: "Не выбрано",
        selectedFactory: "Не выбрано",
        selectedWorker: "Не выбрано",
        selectedTeam: "Не выбрано"
    },
    methods: {
        saveData() {
            // Сохраняем все в куки
            document.cookie = `city=${this.selectedCity};`;
            document.cookie = `factory=${this.selectedFactory};`;
            document.cookie = `worker=${this.selectedWorker};`;
            document.cookie = `team=${this.selectedTeam};`;
            alert("Данные сохранены в куки.");
        }
    }
});
